In [1]:
import pandas as pd
import numpy as np

In [3]:
file_name = "data_with_nan.csv"

df = pd.read_csv(file_name)

In [4]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [5]:
columns = ["col1", "col2", "col3"]
data = [
    ["test1", 13, None],
    ["test2", 44, "aaa"],
    ["test3", None, None],
    [None, None, None]
]

df2 = pd.DataFrame(data=data, columns=columns)
df2

    col1  col2  col3
0  test1  13.0  None
1  test2  44.0   aaa
2  test3   NaN  None
3   None   NaN  None

In [6]:
df["col1"][5]

nan

In [7]:
type(df["col1"][5])

float

In [8]:
df2["col1"][3]

In [9]:
type(df2["col1"][3])

NoneType

In [10]:
columns = ["col1", "col2", "col3"]
data = [
    ["test1", 13, np.nan],
    ["test2", 44, "aaa"],
    ["test3", np.nan, np.nan],
    [np.nan, np.nan, np.nan]
]

df3 = pd.DataFrame(data=data, columns=columns)
df3

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN

In [11]:
df3.fillna("abc")

    col1  col2 col3
0  test1  13.0  abc
1  test2  44.0  aaa
2  test3   abc  abc
3    abc   abc  abc

In [12]:
df3["col1"].fillna("test")

0    test1
1    test2
2    test3
3     test
Name: col1, dtype: object

In [13]:
df3["col2"].fillna(method="ffill")

0    13.0
1    44.0
2    44.0
3    44.0
Name: col2, dtype: float64

In [14]:
df3["col3"].fillna(method="ffill")

0    NaN
1    aaa
2    aaa
3    aaa
Name: col3, dtype: object